"""
Задание 1. Гласные буквы
Команде лингвистов понравилось качество ваших программ, поэтому они
решили заказать функцию для анализатора текста, которая создавала бы
список гласных букв в нём и считала бы их количество.
Напишите программу, которая запрашивает у пользователя текст и генерирует
список гласных букв этого материала (сама строка вводится на русском языке).
Выведите в консоль сам список и его длину.
Пример:
Введите текст: Нужно отнести кольцо в Мордор!
Список гласных букв: ['у', 'о', 'о', 'е', 'и', 'о', 'о', 'о', 'о']
"""

text = 'Используем генератор списка для фильтрации гласных'

vowels_lets = 'ауоыиэяюёе'

def vow_lets(word: str, lets: str) -> list:
    vowels = []
    for let in word.lower():
        if let in lets:
            vowels.append(let)

    return vowels

print(len(vow_lets(text, vowels_lets)))